Reference: 
- https://cafe-mickey.com/python/titanic-basic/
- https://www.codexa.net/kaggle-titanic-beginner/

In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv("data/train.csv")

In [3]:
train.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   name      891 non-null    object
 3   sex       891 non-null    object
 4   age       714 non-null    float64
 5   sibsp     891 non-null    int64
 6   parch     891 non-null    int64
 7   ticket    891 non-null    object
 8   fare      891 non-null    float64
 9   cabin     204 non-null    object
 10  embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [5]:
train.isnull().sum()

survived      0
pclass        0
name          0
sex           0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      2
dtype: int64

In [10]:
null_val = train.isnull().sum()
percent = 100 * null_val/len(train)
missing = pd.concat([null_val, percent], axis=1)
missing = missing.rename(columns = {0 : 'Missing', 1 : '%'})
missing

          Missing          %
survived        0   0.000000
pclass          0   0.000000
name            0   0.000000
sex             0   0.000000
age           177  19.865320
sibsp           0   0.000000
parch           0   0.000000
ticket          0   0.000000
fare            0   0.000000
cabin         687  77.104377
embarked        2   0.224467